load-test/artillery.yml
config:
  # Set TARGET_URL before running:
  #   export TARGET_URL=$(cd ../terraform && terraform output -raw app_url)
  #   artillery run artillery.yml
  target: "{{ $env.TARGET_URL }}"

  phases:
    # Phase 1 — baseline: prove the fleet handles low load comfortably
    - name: "Warm up"
      duration: 30
      arrivalRate: 5

    # Phase 2 — ramp: push CPU above the 60 % scaling threshold on both instances
    - name: "Ramp up"
      duration: 60
      arrivalRate: 5
      rampTo: 70

    # Phase 3 — sustained pressure: hold load while ASG detects high CPU,
    # provisions new instances (~90 s boot), and registers them with the ALB.
    # 4 minutes gives enough time to watch the full scale-out in CloudWatch.
    - name: "Sustained — wait for ASG to scale out"
      duration: 240
      arrivalRate: 70

  # Report latency percentiles
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "CPU work"
    flow:
      - get:
          url: "/work"
          # Treat anything ≥ 500 as a failure (shows up red in the report)
          expect:
            - statusCode: 200