load-test/artillery.yml
config:
  # Set TARGET_URL before running:
  #   export TARGET_URL=$(cd ../terraform && terraform output -raw app_url)
  #   artillery run artillery.yml
  target: "{{ $env.TARGET_URL }}"

  phases:
    # Phase 1 — baseline: prove the two-instance fleet handles low load with ease
    - name: "Warm up"
      duration: 30
      arrivalRate: 5

    # Phase 2 — ramp: both CPUs climb steadily; watch CloudWatch for each instance
    - name: "Ramp up"
      duration: 90
      arrivalRate: 5
      rampTo: 70

    # Phase 3 — saturation: ~35 req/s per instance, past the single-instance breaking point
    - name: "Saturate"
      duration: 120
      arrivalRate: 70

  # Report latency percentiles
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "CPU work"
    flow:
      - get:
          url: "/work"
          # Treat anything ≥ 500 as a failure (shows up red in the report)
          expect:
            - statusCode: 200