load-test/artillery.yml
config:
  # Set TARGET_URL before running:
  #   export TARGET_URL=$(cd ../terraform && terraform output -raw app_url)
  #   artillery run artillery.yml
  target: "{{ $env.TARGET_URL }}"

  # Gradual growth instead of a near-instant spike. A CPU target-tracking
  # policy needs ~3-6 min end to end to react (CloudWatch alarm: 3 datapoints
  # x 60s, then instance boot, then ALB health checks) — see load-test/
  # 04-right-sizing.json for what happens when demand outruns that window
  # (5->70 req/s in 60s -> 72% error rate). Spreading the same total growth
  # over ~16 min instead gives the ASG room to add capacity between each
  # step, so you can watch it keep up in CloudWatch instead of falling behind.
  phases:
  # Phase 1 — baseline: prove the fleet handles low load comfortably
  - name: "Warm up"
    duration: 20
    arrivalRate: 3

  # Phase 2 — organic growth: within baseline capacity (3 instances), no
  # scaling needed yet — this is what "normal" traffic growth looks like
  - name: "Ramp up — within baseline capacity"
    duration: 40
    arrivalRate: 3
    rampTo: 15

  # Phase 3 — crosses the 20 % CPU target, triggers the first scale-out
  - name: "Ramp up — triggers first scale-out"
    duration: 40
    arrivalRate: 15
    rampTo: 30

  # Phase 4 — keeps growing, ASG should add more capacity to keep pace
  - name: "Ramp up — triggers additional scale-out"
    duration: 40
    arrivalRate: 30
    rampTo: 40

  # Phase 5 — sustained peak: by now the fleet should have scaled to
  # absorb this same 70 req/s that caused 72% errors in the flash-spike test
  - name: "Sustained peak"
    duration: 40
    arrivalRate: 40
  # Report latency percentiles
  plugins:
    metrics-by-endpoint: {}

scenarios:
- name: "CPU work"
  flow:
  - get:
      url: "/work"
      # Treat anything ≥ 500 as a failure (shows up red in the report)
      expect:
      - statusCode: 200